app/controllers/admin_controller.rb

  def index
    	@campionati = Champion.order(:priority)
---
SELECT "champions".* FROM "champions" ORDER BY priority

  def giornata

    #inserisco la parte che era su valuta
    # data
    oggi = Date.today
    ieri = Date.parse('2011-10-09')

    #parametri
    @camp = params[:cmp]
    camp = params[:cmp]

    #istanze
    gior = Round.turni_attuali(camp,oggi).first
    @partite = Game.partite_turno(gior)
    @partite_label = Game.partite_turno(gior)
    @giornata = Round.find(gior)
---
SELECT "rounds".* FROM "rounds" WHERE (champion_id = '1' AND data > '2011-09-15') LIMIT 1
SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = 1 LIMIT 1

  def update_plus
    @games = params[:games]
    @games.each do |id, result|
      x = Game.find(id).update_attributes(result)
---
SELECT "games".* FROM "games" WHERE "games"."id" = 0 LIMIT 1
UPDATE "games" SET "result" = '1', "updated_at" = '2011-09-15 21:42:47.650871' WHERE "games"."id" = 241