app/controllers/champions_controller.rb

SELECT "champions".* FROM "champions"
---
  def index
    @champions = Champion.all