app/controllers/home_controller.rb

  def index
  	@campionati = Champion.order(:priority)

  	if current_user
  	  @punti = Score.where(:user_id => current_user).sum('points')
---
SELECT "champions".* FROM "champions" ORDER BY priority
SELECT SUM("scores"."points") AS sum_id FROM "scores" WHERE "scores"."user_id" = 2

  def valutato

    oggi = Date.today
    ieri = Date.parse('2011-10-09')

    # istanze
    camp = params[:cmp]
    gior = Round.turni_attuali(camp,oggi).first
    @giocate = Bet.giocate(gior,current_user.id)
    @giornata = Round.find(gior)
---
SELECT "rounds".* FROM "rounds" WHERE (champion_id = '1' AND data > '2011-09-19') LIMIT 1
SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = 1 LIMIT 1

  def giornata

    #inserisco la parte che era su valuta
    # data
    oggi = Date.today
    ieri = Date.parse('2011-10-09')

    #parametri
    @camp = params[:cmp]
    camp = params[:cmp]

    #istanze
    gior = Round.turni_attuali(camp,oggi).first
    @giocate = Bet.giocate(gior,current_user.id)
    @giornata = Round.find(gior)

    if @giocate.blank?
      # istanze
      @campionato = Champion.find(params[:cmp])
---
SELECT "rounds".* FROM "rounds" WHERE (champion_id = '1' AND data > '2011-09-14') LIMIT 1
SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = 1 LIMIT 1
SELECT "bets".* FROM "bets" WHERE (round_id = 1 AND user_id = 1)
SELECT "champions".* FROM "champions" WHERE "champions"."id" = 1 LIMIT 1